tutorials_13/STR_1200RPM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ( "libbirdmultiphaseEuler.so" );

solver          birdmultiphaseEuler;


startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         30.0;

deltaT          5e-5;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

maxDeltaT       1;

functions
{
   #includeFunc fieldAverage(U.gas, U.liquid, alpha.gas, formicAcid.liquid, H2O.liquid)

    UI
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");

        log             true;
        writeControl    writeTime;
        writeFields     false;

        cellZone        all;
        operation       UI;

        weightField     alpha.liquid;

        fields
        (
            formicAcid.liquid
        );
    }

    disengagement
    {
        type            disengagement;
        libs            ("libbirdmultiphaseEulerFunctionObjects.so");

        //- Properties common to all functionObjects
        executeControl  runTime;
        executeInterval 0.1;
        writeControl    runTime;
        writeInterval   0.1;
        direction (0 1 0);

        //- Properties specific of this functionobject
        phase           liquid;
        inletPhase      gas;
        inlet           inlet;
        tolerance       1e-2;
        nsamples        50;
        disengage       false;
    } 

}


// ************************************************************************* //
