tutorials_13/STR_1200RPM/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
MRF
{
    cellZone    rotor;
    active      yes;

    origin    (0 0 0);
    axis      (0 1 0);
 //   omega     1200 [rpm]; 

    omega
    {
           type      scale;
           scale     linearRamp;
           duration  5.0;
           value     1200 [rpm];
    }
}

// ************************************************************************* //
