tutorials_13/STR_1200RPM/constant/physicalProperties.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/constant/globalVars"

thermoType
{
    type            heRhoThermo;
    mixture         multiComponentMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

species
(
    H2O
    formicAcid
);

defaultSpecie H2O;

H2O
{
    specie
    {
        molWeight   18.0153;
    }
    equationOfState
    {
        rho     1000;
    }
    thermodynamics
    {
        Cp          4180;
        Hf          0; // I think it is not used
    }
    transport
    {
        mu          8.9e-4;
        Pr          0.7;
    }
}

formicAcid
{
    specie
    {
        molWeight   46.03;
    }
    equationOfState
    {
        rho     1220;
    }
    thermodynamics
    {
        Cp          2009;
        Hf          0;
    }
    transport
    {
        mu          1.57e-3;
        Pr          0.7;
    }
}

CO2
{
    specie
    {
        molWeight   44.00995;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrCO2;
    }
}

H2
{
    specie
    {
        molWeight   2.01594;
    }
    equationOfState
    {
        rho     $rho0MixLiq;
    }
    thermodynamics
    {
        Cp          $CpMixLiq;
        Hf         -1.5879e+07;//-9402451;
    }
    transport
    {
        mu          $muMixLiq;
        Pr          $PrH2;
    }
}


// ************************************************************************* //
