tutorials_13/STR_1200RPM/0.org/epsilon.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.5e-05;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 1.5e-05;
        value           uniform 1.5e-05;
    }
    propeller
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-05;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 1.5e-05;
    }
    inside_to_hub
    {
        type            empty;
    }
    inside_to_hub_copy
    {
        type            empty;
    }
    hub_to_rotor
    {
        type            empty;
    }
    hub_to_rotor_copy
    {
        type            empty;
    }
}


// ************************************************************************* //
