tutorials_13/STR_1200RPM/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

default
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
    volScalarFieldValue H2O.liquid 1
    volScalarFieldValue formicAcid.liquid 0
);

regions
(
    boxToCell
    {
        box (-1.0 -0.5 -1.0) (1.0 0.0741 1.0);
        fieldValues
        (
            volScalarFieldValue alpha.gas 0.0
            volScalarFieldValue alpha.liquid 1.0
        );
    }

    boxToCell
    {
        box (-1.0 0.0385 -1.0) (1.0 0.0741 1.0);
        fieldValues
        (
            volScalarFieldValue H2O.liquid 1
            volScalarFieldValue formicAcid.liquid 0
        );
    }
);


// ************************************************************************* //
